从 pygame.image 导入 *
从 游戏派.类库.表层 导入 表层类
类 图像汉化类():


    套路 读取(自身,文件名)->表层类:
        '''读取一个新的图像
        返回一个表层对象
        '''
        返回 表层类(load(文件名))

    套路 保存(自身,表层,文件名):
        '''将表层保存为一个文件
        '''
        save(表层,文件名)

    套路 可读性(自身):
        '''测试扩展图像能否被读取
        '''
        返回 get_extended()

    套路 字符串化(自身,表层,格式,翻转=假):
        '''将图像字符串化
        <格式>为'RGB' 'RGBX' 'RGBA'...
        返回字符串
        '''
        返回 tostring(表层,格式,翻转)

    套路 反字符串化(自身,字符串,尺寸,格式,翻转=假):
        '''将字符串转化成图像
        返回图像的表层
        '''
        返回 fromstring(字符串,尺寸,格式,翻转)

    套路 反字符串化(自身,字符串,尺寸,格式):
        '''将字符串转化成图像,无法翻转,速度快
        返回图像的表层
        '''
        返回 frombuffer(字符串,尺寸,格式,翻转)
