导入 pygame

颜色字典 = 字典型(红='r', 绿='g', 蓝='b', 不透明度='a')
颜色字典英中 = 字典型([值, 键] 取 键, 值 于 颜色字典.项々())

类 颜色类(pygame.Color):

    套路 __getattr__(自身, 键):

        颜色_ = 颜色字典.获取(键, 键)
        返回 object.__getattribute__(自身, 颜色_)

    套路 __setattr__(自身, 键, 值):

        颜色_ = 颜色字典.获取(键, 键)
        返回 object.__setattr__(自身, 颜色_, 值)

    套路 归一化(自身):
        '''返回[0,1]小数表示的RGB值
        '''
        返回 自身.normalize()

    套路 修正伽马(自身, 伽马):
        '''通过伽马调整RGB的颜色
        '''
        返回 自身.correct_gamma(伽马)

    套路 设置色元(自身, 数量):
        '''设置颜色的元素个数,默认为4(r,g,b,a)
        通过len(颜色实例),可以得到色元个数
        '''
        返回 自身.set_length(数量)