从 pygame.mouse 导入 *

类 鼠标汉化类():

    套路 获取按键(自身):
        '''获取鼠标按键的情况,是否被按下\n
        参数: 空\n
        返回: 一个由布尔值组成的元组，代表所有鼠标按键被按下的情况
        '''       
        返回 get_pressed()

    套路 获取位置(自身):
        '''获取鼠标光标的位置.\n
        在使用此方法前记住要先调用 pygame.event.get() 方法，否则此方法将不会工作\n
        参数: 空\n
        返回: 鼠标光标的坐标元组 (x, y)
        '''       
        返回 get_pos()

    套路 设置位置(自身,位置):
        '''设置鼠标光标的位置.\n
        参数: 位置元组型(x,y)\n
        返回: 空
        '''       
        返回 set_pos(位置)

    套路 获取轨迹(自身):
        '''获取调用此方法之前的一系列活动坐标轨迹.\n
        参数: 空\n
        返回: 鼠标光标的一系列坐标列表
        '''       
        返回 get_pos()

    套路 光标可见性(自身,可见性):
        '''显示或隐藏鼠标光标.\n
        参数: <可见性>,为真时,光标可视.为假时,光标不可视\n
        返回: 光标在调用该方法之前的可视化情况.
        '''       
        返回 set_visible()

    套路 获取焦点(自身):
        '''检查程序界面是否获得鼠标焦点.\n
        参数: 空\n
        返回: 窗口接受鼠标激活状态时,返回真,否则返回假.
        '''       
        返回 get_focused()

    套路 设置光标图像(自身,尺寸,热点,xor蒙层,and蒙层):
        '''设置鼠标光标在程序内的显示图像.\n
        参数: <尺寸>,光标的宽度和高度,元组类型
            <热点>,光标的热点位置,元组类型
            <xor蒙层>,一组字节，用于进行按 位异或掩码 的计算
            <and蒙层>,一组字节，用于进行按 位与掩码 的计算
        返回: 空
        '''       
        set_cursor(尺寸,热点,xor蒙层,and蒙层)

    套路 获取光标图像(自身):
        '''获取鼠标光标在程序内的显示图像.\n
        参数: 空\n
        返回: (尺寸,热点,xor蒙层,and蒙层)元组数据
        '''       
        返回 get_focused()