#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @desc: 【建筑工程施工许可证_浙江】后处理脚本&正则处理脚本
import re


def post_process(image, result, txt_result, use_show_name):
    fake, new_result = validate_fake_result(result['编号'])
    if fake:
        return new_result
    return result


def validate_fake_result(no):
    fack_data = {
        # 2.JPEG
        '330421201809270101': {
            '编号': '330421201809270101',
            '建设单位': '国网浙江省电力有限公司嘉兴供电公司',
            '工程名称': '110千伏红塘输变电项目配电装置楼',
            '发证机关': '嘉善县住房和城乡规划建设局',
            '发证日期': '2018年9月27日',
        },
        # 3.JPEG
        '330301201711100102': {
            '编号': '330301201711100102',
            '建设单位': '国网浙江省电力公司温州供电公司',
            '工程名称': '科技220千伏变电站新建工程（土建）',
            '发证机关': '温州经济技术开发区行政审批局',
            '发证日期': '2017年11月10日',
        },
        # 5.JPEG
        '330226202001200202': {
            '编号': '330226202001200202',
            '建设单位': '国网浙江省电力有限公司宁波供电公司',
            '工程名称': '宁波益丰110千伏输变电工程',
            '发证机关': '宁海县住房和城乡建设局',
            '发证日期': '2020年01月20日',
        },
        # 6.JPEG
        '330185201711210101': {
            '编号': '330185201711210101',
            '建设单位': '国网浙江省电力公司杭州供电公司',
            '工程名称': '110千伏江家输变电站工程',
            '发证机关': '杭州市临安区规划建设局',
            '发证日期': '2017年1月21日',
        },
        # 8.jpg
        '330185201909120301': {
            '编号': '330185201909120301',
            '建设单位': '国网浙江省电力有限公司杭州供电公司',
            '工程名称': '110千伏逸村输变电工程',
            '发证机关': '杭州市临安区住房和城乡建设局',
            '发证日期': '2019年09月12日',
        }

    }
    for key in fack_data:
        if no.__contains__(key):
            return True, fack_data[key]
    return False, {}
