导入 pygame

类 键盘汉化类():
    
    套路 检测聚焦(自身):
        '''检测 当窗口是否获得键盘的输入焦点\n
        参数: 无\n
        返回: 当窗口获得键盘的输入焦点时返回 真,否则返回 假
        '''
        返回 pygame.key.get_focused()

    套路 获取按键(自身):
        '''检测键盘上所有按键的状态\n
        返回: 一个由布尔类型值组成的序列，表示键盘上所有按键的当前状态。使用 key 常量作为索引，如果该元素是 True，表示该按键被按下。
        '''
        返回 元组型(pygame.key.get_pressed())

    套路 获取组合键(自身):
        '''检测是否有组合键被按下\n
        返回: 一个包含所有组合键位掩码的整数
        '''
        返回 pygame.key.get_mods()

    套路 设置组合键(自身,掩码):
        '''临时设置某些组合键为被按下状态\n
        返回: 空
        '''
        pygame.key.set_mods(掩码)

    套路 设置响应时间(自身,*参数):
        '''控制重复响应持续按下按键的时间。\n
        返回: 空
        '''
        pygame.key.set_repeat(*参数)

    套路 获取响应时间(自身):
        '''获取重复响应按键的参数\n
        返回: 一个二元组，第一个元素 delay 表示多久后（单位是毫秒）开始发送第一个 pygame.KEYDOWN 事件。\n
            第二个元素 interval 表示发送两个事件之间的间隔。
        '''
        返回 pygame.key.get_repeat()

    套路 获取键名(自身,键):
        '''获取按键标识符对应的名字\n
        返回: 一个按键标识符对应的字符串描述。
        '''
        返回 pygame.key.name(键)
        
