from time import sleep
import sys
import os
import hashlib
import keyboard

ART = '''
        
                                                                                                                                                              
                                                                        ,*(((/(///,*/*/*                                                              
                                                               ,*(((((((((((/(///((/(/(//////////,.,/                                                 
                                               ((( (((((((((((((((/(/(//////////*///////////////////                                                  
                                           ((((###((((((((((((//////******************/////***///(////////*,.                                         
                                       .##########((////////*/**/***********************,***/***//////////////,*,,/.                                  
                                     ,/#####((((((///////*/*****************************,,******//*/***//////((/(/////*/                              
                                  #*#######((((/#/*/************************,**************,*,**,,****/***///////(//((//                              
                               ((######(((((/////*//*/************************,*,*,*****,*,*,,*,*,****/*******/**////(/(///                           
                            **#####%#(#((((///*//////**********************,******,*******,,,**,,,,,,**,**********//////(///                          
                           *%#######((((((/////***/**/**************************,****,,,*******,,,,,,,,****,*******////(((/**,                        
                          %%%%##%#((((((//////*//**/*/***********************//////*/**************,,,,***************//((/(((//                      
                         %%%%%###((#((//////(////(/(///////////////////////////////////////////*******************/**//////(((((//*                   
                       (#%%%%##%%#((((((/(((((((((((((/((((((((((((/((///////((((((((((((((((///////////////******,*//*//((((((((*,*                  
                       #%#%%%%###((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((/(/(////****///////(((((((/                  
                      %%%%%####(((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((/////////(/(((((/,                  
                     *%%%%%#########(#((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((//*/////(((((,                  
                    %%%%&&%############((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((///*/((((((                  
                   ,%%%%%%%%###########(((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((########(((/*//(((((.                 
                    %%%#%#%%#############(##((((#######((((((((((((((((((((((((((((((((((((((((((((((((((((((((((###########///(((( (                 
                   *%%%%%#%%###########################(##((#((###(((#((((((((((((((((((((((((((((((#(((#(((((((###(#########//((((((                 
                   *%%%%%%%#######################################(((##(((((((((((((((########(##((#(#########################(/((((                  
                   %%&%%%%%%####################################((((((((((((((((((((((((((#(((((((((##(########################(((((.                 
                  %#%%%%%#%%%%#########################(((((((####(((((((#(((((((((((((((((((((((((((((########################(((((((                
                  ##%##%%%%%%%%#%%##################(((#(((((((((((((((((##((((((((((((((((((((((((((((((#((####################(((((/.               
                  *####%%%%%%%##%###############((#(#((###((((((((((#((((###########(((((((((((((((((((((((######################((((,                
                   ####%%%%%%%%###########((((((((((((((((((((((((((####((((((((#((#####(((((((((((((((((((((((#################((((.,                
                  ###%#%%%%%%%%####((((((///(/((((((((((((((((((((((((((((((((((((((###(((((((((((((/////////((((((((##(####%####((((,                
                  ####%%%%%%%%#((((/////////*********///((((((((((((((((((((((((((((((((((((((//////****,,*,,********///(((##%###((((                 
                  #####%%%%%#((///////***********,**,****//////////(((((((((((((((((((/////(///***,,,,,,,,,,,,,**********//(#%###((((                 
                  (###%%%%###((/////*/***********,,,,*****///***/**////(((((((((///////*/*//***,,,,,,,,,,,**************/////(%##(((                  
                  ###%%&%%(((///(/////////////*/************//***//**/(((((((((((/**//*******,,,,,,********//////////////////(/(#((((                 
                   ###%%##(#((((((((((((///////////////********//*////((((((((((((/***/***************////////////////(///((//((((((                  
                   ##%%%##(###(((((/(//////////////////////////////((((((###(((#(((/**************////*///*//////////((((((((((#((((                  
                   ##%%%#%%%#(((//(/***,,,,,,,**,,,*,,,,****////(((((((#(((##(((((((/*********,,,,,,,,,,,,,,,,,..,***//((((((((#((((                  
                   #%%%%%%%%#((/**,,**/////((((((///************/(#((##((##((####((((/***,,****,,,*///(((/(/(//***,,,,,*/(((((((###(                  
                  ##%%%%%%%#(/******/(((**////(***((//*****/////((####(###((((((####(((/****,,,**//((**////*,,(((((*,,,,,*/((((###((                  
                  ##%&%%%##(/******/(((/**/,.,.****/////*//*///(######(###((##(########(//*******///,,*..,.,,,,((##*,,,**,*/((((#%#(                  
                  ##&&%%###(///(##((/////////////////**//////(#((###%######(#((######((##((/**/****/**/**,,,,,***/*////****/((((#%#(                  
                  #%&&%%##((((#####((((((((///////////////(((##############((#############((((////////////****////(((((((////(((#%%(                  
                  %&&%%%###########((((((((((((((((/////((((#############((((((((######((((((((((//**/////(///(((((((((##(((((((##%#(                 
                 %%&&%%###########(((((((///////(((((((((((((###%%#######(((((((########((/((((((((((/(/////////(((((((###((((((##%#(                 
                &%&&&%%########(((((((((((((((((((((((((((((/(##########((((((((((#####(((///((((((((((((((((((((((((##(#####((####%(,                
               &#(&&%%%#%#########((((((((((((((((((((((((//(###%#%###((((((((((((#####((((**//((((((((((((((((((((###########((###%(#(               
               %/(&&%%%%%########(#((((((((((((((((((((((//#####%######(((((((((((((####(##(/*///((((((((((((((((((##################*/,              
              %#/(&&%%%%%#%%########(#####((##(((((((((//#####%%%%%##((((((((((((((((########(**//(((((((((((((((((##(###############*//              
              #((#&&%%%%%%%%##########(((((((((((((((///#%%%%%%%%###((((((((/////((((((((#####(***///((((((((((((((((#(#############%*//              
              #(/%&&%%%%%%%#%#%#####(((((((((((((((//**/######(((((((((((////////////////((((((****///((((((((((((((((##############%///              
              #(#%&&&%%%%%%%%%######((((((((((((((///*///(//*,,,,,,,,*(((/////////,,,,,,,,,*//****,*/////(((((((((((((((#######(####%///              
               #(%&&%%%%%%%%%%###((((((((((((((((//**//////*****////////(///**//******/********//**,*//////((((((((((((((((##########(/.              
              %%(%&&%%%%%%%%%%###(((((((((((((((///*//(/////////***********************/*//////////*,**//////((((((((((((((#(##(#(###(/               
              #%(%&%%%%%%%%%#%####((((((((((((////*//(((//////**,****,,**********,,*****/***///////*****///////((((((((((((((#((#(###((               
              %%%%%%%%%%%%%%%%##(((((((((((((////*//((///*/*//**,*,,,,,,*********,,,,**,**,,**//*/******///////////(((((((((((#((####(                
              *###%%%%%%%%%%%%%##((((((((((/////**//////********,,,,,,*,,********,,,,,,,,,,,,,,*******,**////////////(((((((((((((##((                
               %%#%%%%%%%%%%#%####(((((((((////**//////***/*****,,,,,,,,*,**/********,,,*,,*,,,*,******,**///////////((((((((((((((((/                
               *%%#%%%%%%%%%%#%####((((((((////*/////****,//**///******/////(((((((////////***,***,****,***//////////((((((((((((((//,                
                %%(####%%%%%##%###(((((((////***//*///*//////((/(/////////////////////////////(///***,**,***/////////((((((((((/(/(//                 
                 %#%%##%%%%%%#####(((((////********//((#(((///////***************************///((((/**,,,**////////((((((((((((//(//                 
                 *(###(#%###%%#%%###((((///**,****/###(///***********//////////((/*******,,,******/((/,,*,**////////(((((((((((/////                  
                  #((##(%%%#%###%#((((((////*,***/(%#(/*******/((((((######((######(/((((/*********/(/,*,,***/////////((((((/(**///,                  
                   (#(#(###%#(####((((((///***/**/(#/*******//##%##(#%%%%%###%%%%###(#####////******//,,,,*****////////(((((////***                   
                    (####(####(###((((/////*,,***///******/((#%#####%%%%%%%##%######*(###(/(((*,*****/*,,,****/////////((((/(/*///                    
                     #(##(####((#(((//////**,,**////****............(####*,................   .,*********,**///////////(///(//*/*                     
                     *##(%##%###(((/(//////*,,,*//******.................................. ....,*********,,*/*///////////*//#//*/                     
                      #(#####(#(((#////////**,*////***,..............,.,,...,,,,,,,,........ ..,*********,**/**///////**/*//**//                      
                      ####((#(##(#(////**//***/*//****,.........,,,,,,,,,,,,,,,,,,,,,,,... .....,**,*/***,,*//*///*********//*/*                      
                       ##(###(##(((//////*/*,***//***,.,,......,,,*,*,*,,,,,,,,*,,,,,,,,,.......,***//****,***///**//*****/*(*/,                      
                       *((##(((((/(((///******/////**..,,....,,,***********,,***********,,.......*////***,****///*****,*/**//*/                       
                       ,(#((/##((////////**,,***//(/*,,,,,,..,,***///////**,*************,..,,,,**////***,,,,******,**,*****(*/                       
                       .//(///**//(///**/**,,,***/(//*,,**..,,*****////////**////////****.,******/////**,,,,,******,,,,**,**,**                       
                        /(//(((*/*/(//**/,,,,,**//((/*****/,.,******///////**//////****,..////////(//*****,,.,,***,,,,,,*,,***                        
                         ////((//****//***,,,***//(((/***/**..,,***********/**/*/***,,...,(((/*//////*******,,,*,,,....**,,,**                        
                         (/#*/((/**/(***,*,.,,***/(((///*//,,,,,,,,,,***********,,,,,**,.//((/*//////*****,,,*,,,,,,,,,,*,,,**...,,.                  
                         ,,/(////,*//****,,,,,,*///(/(/////(/,,,********,...,********,,,(((((/*///(//*/*,,,****,,*,*.,,,,,,,,.. .,..,,,,*             
                       /((//***///**//**,,,..,,*///(((///*/(###*****/*****************####//***///(//***,,,,****,*.,,,,,,,,,*,........,,.,,,          
                  #((((/,,.,(/*/**(**/**,...,,,,*//(((///**((#(####(((###((#####((###(((((/,**///(////**,,,,*******,,.,,,,,*/..,.....,,.,,,,,,        
               *((//*,....,.,,#(*/*,**/,,.,.,,,,*//((((///**/(//((#((/((((//((((/(((///(/*//////(/////*,.,.,*****,,,,...,,/*,   .,. .,.....,,,,,      
  ,*/(//((((((((/*,,....  ...,//(********,,.,,,,*///(((////////***///////////////**///////////////////,..,*,**,,/,.,.,...,*,,,,,.,....    ....,.,*****
//******//**/(/*,.....     ../,/**,/**,**,*,*,,,**///((///////////////(///////(((//(//////////*//////,,.,.,***,*,,.,,,,..,,,...,,.......,.,....,*****,
.....,,*///((*....        ...,**/,,,//,*/*,,*/*,,,*////(//////((//(((((((////((((/((////*****///////,,,..,,/****,,..,...,,.........,,..   ..,,,,,,...,
....,*******,...         .../,./**,****,,***,,,,,***/////////*//////////////////////*******///////**,,,,..**,,,,,.,.,..**,........ .,,,   .,. .,,.,,,,
*/////*.......     . ....,*,....**,*,/,,,,**,***,,,,*///////***********************,,*******/*///***,,..,*,,,,,.,... ..*/ ........ .,...      ..,...,,
/****,,,.......   ....,**,....  ,.**,/,*,,,,,****,*****/*******,,,,,,,,,,,,,,,,,,,,,,,*,***///*****,,,,,,,,,,,...... ,*/, .......   .....      .,,.,,.
,,,,,,,,...         .,,,...... .,..,*,,*,,*,*//*,,.,,*,**********,,,,,,,.,,,,*,,,,,,,*,,**/*****,,*.,,,,.,,,...    .,*/*.........   ......      ,...,,
,.......           ,,......    ....,.,*,*,,*,*(,,,,**,,*,,*,***,*,,,,*,,,,,,,,,,,,,,,,,*****,,*,,,,.,,...,,,.,... ,*//*, ....  .     ......     .....,
.....            .,,.......   ....,...***,*,**/,*,,,**,*,,*,,,,,,,,.,,,..,,,,,....,,,,**,,,,,,.,,,,...,..,.....,.,*/**,. ...          ......     .....
..              .,......     .....,..,,***,*,*,,*.,,*,*......,,...,,,...,.,..,.,,,,,,,,*,,.,.,.,,,,...,...,.,.,*****,,.      .          ....     .....
            .........         ....... .,****/,,,**,*,,,.,,,,,.,.....,,,,,,,,,,,,,,,,,.,.*,,..,...,,..........***/**,,,.  ..               ...     ....
          ..........        . ..........,**/**,,*,,/,,,,,,.,.,,,,,,,,,,,.*,,.,,.,,,,,,,..,......,......,,..,*******,,.                     ...     ...
       .........         .  .  ... .....,,*****,../,...*.,,,.....,,,,,,,,,.,...,,,,.,,.............  ...,,********,,. .    ..               ...     ..
  .... ........              ...........,,***//*.*,..,.,......,.........,.....,....,............ .  ...,*********,,,  .    .                 ...    ..
....   ......               ... ... ....,,*****/*/**,,,.,.........................,.........      ..,,.*********,,,  .      .                ....    .
... . .....      .....    .....    ......,,*****////*,/**....... ..  . ............. .  . .     ..,,************,,                             ...    
. .......       ....     ....      . ...,,*****////////**,**..... .        .         .       ..,***************,,                               ..    
 .......       ....       .          .. ,,,****///////////****,..,,,,........   ......,...,,*,*****************,          .                     ...   
........    .....           .  .    ... ,,*****///*////////***********,,.,...,*,,*,,,**,*************//*******,          .                       ...  
... ..     .....                     .. .,,****//*/**////////*****/***,*,**********************//**////******           .                             
 .       .......                     ....,,****///*/*/////*/****************************/////////////******.                                        . 
 .        ....                       ... ,,*****//////**///**/******************/*****//////////////*****,                                            
 .      ....            .            ... ,,,***/*/////*///*/***/****////**/**/**/**///////*///*//******.                                              
         .....              .        ... ,,,**//***///*//*/***//*****/**////////*/////*//////*/******                                                 
         ...                          .. .,,****///**////*/***/*///*///////////////////*///******,                                                    
  .     . .                           ... ,,***/****/**/////////////////*//////*///*//*********.                                          .           
        .   .                          ..  ,***********//////*****/**///****//***/*//*//**,.                                                          
                                       ...  ,,*******,**/****/////****////*///*/******/.                                                              
        .                              ...    ,*****////*/****//*/****///*/*******,                                                                   

        '''




def clear():
  os.system('cls')




def bye():
    keyboard.press('f11')
    os.system('color 07')
    clear()
    sys.stdout.flush()  
    print("Press F11 any time to exit full screen!\n")
    print("full screen will be better!, I'll wait for 12 seconds now...")
    sleep(12)
    clear()
    if(input("ARE YOU MAGSHIMIM NETWORK STUDENT? (YES/NO)"+"    ").lower() == "yes"):
        os.system('color 0F')
        clear()
        sleep(1)
        print("Oh GREAT! it's you again....")
        sleep(3)
        clear()
        ans = input("IF YOU ARE REALLY MAGSHIMIM STUDENT - WHO IS THE BEST TEACHER YOU EVER MET?  \n")
        while ans.lower() != "tomer":
          clear()
          if(ans.lower() == "yaniv"):
            ans = input("WRONG ANSWER!\nNice try... Yaniv...\nI ASKED\nWHO IS THE BEST TEACHER\nYOU EVER MET?  \n")
          elif(ans.lower() == "dvir"):
            ans = input("WRONG ANSWER!\nNice try... Dvir...\nI ASKED\nWHO IS THE BEST TEACHER\nYOU EVER MET?  \n")
          else:
            ans = input("WHAT YOU SAID?!?!?!  WRONG ANSWER!\nI ASKED\nWHO IS THE BEST TEACHER\nYOU EVER MET?  \n")
        clear()
        
        ans = input("Very nice... very nice...\nBut everybody knows that Tomer is the best, anyone could answer that.\nIF YOU ARE REALLY MAGSHIMIM NETWORK STUDENT - WHO IS THE BEST BIG BROTHER (aka. 'Achbag') YOU EVER KNEW?\n")
        while ans.lower() != "eden":
          clear()
          if(ans.lower() == "arad"):
            ans = input("Arad is amazing too, you got a point...\nSo let me ask again - who is the best NETWORK big brother you know?\n")
          else:
            ans = input("I start thinking you are not really magshimim student. Try again - \nWho is the best Big brother (aka 'bro') you know?\n")
        clear()
        os.system('color A')
        print("WHO DARE TO WAKE ME UP FROM MY SLEEP?!?!\n")
        sleep(4)
        for line in ART.splitlines():
          print(line)
          sleep(0.02)

        sleep(2)
        student = input("\n\nWHO ARE YOU?\n")
        while student.lower() not in STUDENTS.keys():
          student = input("I SAID - WHO ARE YOU???  WHAT IS YOUR NAME????\n")
        clear()
        print("Ohh...")
        sleep(2)
        clear()
        print("Is it really you "+student+"?")
        sleep(3)
        clear()
        print("I guess its time to say goodbye...")
        sleep(4)
        clear()
        STUDENTS[student]()
    else:
        print("YOU HAVE NOTHING TO LOOK FOR HRER - BYE!!!")
        keyboard.press('f11')
        sleep(6)
        os.system('color 07')
        os.system('exit')
        

def mendi():
    clear()
    id = input("What is your id (Tehudat-Zehut)?\n")
    while hashlib.md5(id.encode()).digest() != b'\xa6A0\xcd\x7fM\xe5n\xb3\xc1\xce\x19\x0e\x85<\xbb':
      clear()
      id = input("What is your id (Tehudat-Zehut)?\n")
    clear()
    sleep(3)
    print('''
    ______________________________
 / \  Dear Mendi,                \.
|   |                            |.
 \_ | It was my pleasure to teach|.
    | you.                       |.
    | You are one of the         |.
    | strongest students I ever  |.
    | had.                       |.
    | Keep doing with the hard   |.
    | work and perfection,       |.
    |                            |.
    | Big future is ahead of you!|.
    |                            |.
    | Yours,                     |.
    | Tomer Eliel                |.
    | MAGSHIMIM-NETWORK-2022     |.
    |   _________________________|___
    |  /                            /.
    \_/____________________________/.
    ''')
    f = open("To Mendi.txt",'w')
    f.write('''
    מנדי,
    תודה רבה על שנה מדהימה,
    היה לי העונג ללמד אותך.
    אתה תלמיד וחניך ייחודי ויוצא דופן - 
    כזה שקולט הכל ברגע וכבר רואה את הבאות.

    אני צופה לך עתיד מזהיר, תמשיך בדרך הסקרנית והעוצמתית שלך.

    מעריך המון,
    תומר אליאל.
    רשתות, מגשימים, 2022.
    
    ''')
    f.close()
    print("'To mendi.txt' file was just created, READ IT!")
    sleep(5)
    keyboard.press('f11')
    sleep(40)
    os.system('exit')




def adi():
    clear()
    id = input("What is your id (Tehudat-Zehut)?\n")
    while hashlib.md5(id.encode()).digest()!= b'TXBf\x01\x80\x9a\x06\x83\x9d\xd4\xa7\xeb4\x92O':
      clear()
      id = input("What is your id (Tehudat-Zehut)?\n")
    clear()
    sleep(3)
    print('''
    ______________________________
 / \  Dear Adi,                  \.
|   |                            |.
 \_ | It was my pleasure to teach|.
    | you.                       |.
    | I know it was a challenging|.
    | year but you made it and i |.
    | am proud of you!           |.
    | keep with the hard work    |.
    |                            |.
    |                            |.
    |                            |.
    | Yours,                     |.
    | Tomer Eliel                |.
    | MAGSHIMIM-NETWORK-2022     |.
    |   _________________________|___
    |  /                            /.
    \_/____________________________/.
    ''')
    f = open("To Adi.txt",'w')
    f.write('''
    עדי היקרה,

    זו הייתה שנה לא קלה, מלאה אתגרים ומשימות.
    אבל עמדת בהן בגבורה ומכאן את יוצאת חזקה יותר.
    אין אתגר בעולם שלא תוכלי לעמוד בפניו - ולא, לא בגלל שאת יודעת פייתון, אלה בגלל שרכשת כלים לחיים.
    אני גאה בך!

    תמשיכי להיות שקטה ונעימה לבריות כמו שאת.
    
    שמחתי להכיר.
    תומר אליאל.
    רשתות, מגשימים, 2022.
    ''')
    f.close()
    print("'To Adi.txt' file was just created, READ IT!")
    sleep(5)
    keyboard.press('f11')
    sleep(40)
    os.system('exit')




def itamar():
    clear()
    id = input("What is your id (Tehudat-Zehut)?\n")
    while hashlib.md5(id.encode()).digest()!= b'\n\t>:\x0fl\xfc\x87\xd9\xa6\x1e\x16\xd4\x8a\xad\xb8':
      clear()
      id = input("What is your id (Tehudat-Zehut)?\n")
    clear()
    sleep(3)
    print('''
    ______________________________
 / \  Dear Itamar,               \.
|   |                            |.
 \_ | It was my pleasure to teach|.
    | you.                       |.
    | You are funny and hard     |.
    | worker studenet            |.
    | You are great at programing|.
    | and nailed this year.      |. 
    |                            |.
    | I'm proud of you!          |.
    |                            |.
    | Yours,                     |.
    | Tomer Eliel                |.
    | MAGSHIMIM-NETWORK-2022     |.
    |   _________________________|___
    |  /                            /.
    \_/____________________________/.
    ''')
    f = open("To Itamar.txt",'w')
    f.write('''
    איתמר,

    היה לי העונג ללמד אותך,
    אתה חניך מעולה ומצחיק.
    כזה שכולם אוהבים.

    יש לך יכולות למידה מדהימות ועברת את השנה הזו בעוצמה!

    כל הכבוד!
    גאה בך!

    מאחל לך הצלחה בהמשך,
    תומר אליאל.
    רשתות, מגשימים, 2022.
    
    ''')
    f.close()
    print("'To Itamar.txt' file was just created, READ IT!")
    sleep(5)
    keyboard.press('f11')
    sleep(40)
    os.system('exit')



def eden():
    sleep(3)
    print('''
    ______________________________
 / \  Dear Eden ,                \.
|   |                            |.
 \_ | THANK YOU for amazing year!|.
    |                            |.
    | You helped me so much and  |.
    | really was my right hand   |.
    | I don't know what I was    |.
    | doing without you          |.
    |                            |.
    | Good luck at the army and  |.
    | STAY SAFE!                 |.
    |                            |.
    | Yours,                     |.
    | Tomer Eliel                |.
    | MAGSHIMIM-NETWORK-2022     |.
    |   _________________________|___
    |  /                            /.
    \_/____________________________/.
    ''')
    f = open("To Eden.txt",'w')
    f.write('''
    עדן היקר,

    מה אני יכול להגיד לך חוץ מתודה תודה תודה תודה!
    היית לצידי ולימיני כל השנה ולא יודע מה הייתי עושה בלעדייך!
    אתה אלוף אמיתי!

    מאחל לך בהצלחה בצבא ובהמשך,
    תישאר בטוח ושמור על עצמך!

    ושוב תודה,
    תומר אליאל
    רשתות, מגשימים, 2022.
    ''')
    f.close()
    print("'To Eden.txt' file was just created, READ IT!")
    sleep(5)
    keyboard.press('f11')
    sleep(40)
    os.system('exit')


def ariel():
    clear()
    id = input("What is your id (Tehudat-Zehut)?\n")
    while hashlib.md5(id.encode()).digest()!= b'x\xa6\xd9\x1c8\xc0\xc6@\x1c`\xce \xc0\xb5\xc3b':
      clear()
      id = input("What is your id (Tehudat-Zehut)?\n")
    clear()
    sleep(3)
    print('''
    ______________________________
 / \  Dear Ariel,                \.
|   |                            |.
 \_ | It was my pleasure to teach|.
    | you.                       |.
    | You are talented studend - |.
    | funny and really social but|.
    | also one of the smartest.  |.
    |                            |.
    |                            |.
    | Big future is ahead of you |.
    |                            |.
    | Yours,                     |.
    | Tomer Eliel                |.
    | MAGSHIMIM-NETWORK-2022     |.
    |   _________________________|___
    |  /                            /.
    \_/____________________________/.
    ''')
    f = open("To Ariel.txt",'w')
    f.write('''
    אריאל היקרה,

    היה לי הכבוד והעונג ללמד אותך,
    את חניכה מדהימה, כזאת שכולם אוהבים ורוצים להיות בחברתה.
    את מצחיקה וחכמה וזה שילוב נדיר!

    תמשיכי להוסיף צבע בכל מקום שתהי בו.
    את אלופה אמיתית!

    שלך,
    תומר אליאל.
    רשתות, מגשימים, 2022.
    ''')
    f.close()
    print("'To Ariel.txt' file was just created, READ IT!")
    sleep(5)
    keyboard.press('f11')
    sleep(40)
    os.system('exit')


def shilo():
    clear()
    id = input("What is your id (Tehudat-Zehut)?\n")
    while hashlib.md5(id.encode()).digest()!= b'\xe4\xbf#\x86\xd7\xb5G\x1fgUl\xab\xb1\xc7\xb6"':
      clear()
      id = input("What is your id (Tehudat-Zehut)?\n")
    clear()
    sleep(3)
    print('''
    ______________________________
 / \  Dear Shilo,                \.
|   |                            |.
 \_ | It was my pleasure to teach|.
    | you.                       |.
    | You are one of the         |.
    | strongeststudents I ever   |.
    | had.                       |.
    | You are rare combination   |.
    | of smart along side very   |.
    | social student.            |.
    |                            |.
    | Stay Awesome!              |.
    |                            |.
    | Yours,                     |.
    | Tomer Eliel                |.
    | MAGSHIMIM-NETWORK-2022     |.
    |   _________________________|___
    |  /                            /.
    \_/____________________________/.
    ''')
    f = open("To Shilo.txt",'w')
    f.write('''
    שילה היקר,

    אתה שפיץ אמיתי!
    מהחניכים החזקים שיצא לי לפגוש.
    כזה שמשלב מוח והבנה ענקיים אבל גם יכולות חברתיות מדהימות.
    תמשיך לאגד את כל החברים סביבך והישאר כמו שאתה.

    היה לי הכבוד והעונג ללמד אותך.
    מבריק אמיתי.

    שלך,
    תומר אליאל.
    רשתות, מגשימים ,2022.

    ''')
    f.close()
    print("'To Shilo.txt' file was just created, READ IT!")
    sleep(5)
    keyboard.press('f11')
    sleep(40)
    os.system('exit')



def amitay():
    clear()
    id = input("What is your id (Tehudat-Zehut)?\n")
    while hashlib.md5(id.encode()).digest()!= b'\x13<\x14\x96\x04\x8b]G\x08*|\x96B\xa7\x13`':
      clear()
      id = input("What is your id (Tehudat-Zehut)?\n")
    clear()
    sleep(3)
    print('''
    ______________________________
 / \  Dear Amitay,                \.
|   |                            |.
 \_ | It was my pleasure to teach|.
    | you.                       |.
    | You are very curious and it|.
    | is amazing!                |.
    | Sorry for now answering all|.
    | of your questions. but ower|.
    | time was limited.          |.
    |                            |.
    |                            |.
    | Keep explore and           |.
    | disvocer!                  |.
    |                            |.
    | Yours,                     |.
    | Tomer Eliel                |.
    | MAGSHIMIM-NETWORK-2022     |.
    |   _________________________|___
    |  /                            /.
    \_/____________________________/.
    ''')
    f = open("To Amitay.txt",'w')
    f.write('''
    אמיתי היקר,

    אתה חניך סקרן וחכם בטירוף.

    תמשיך לגלות עיניין וסקרנות בכל דבר כמו שאתה עושה.
    אתה עוד תגיע לגדולות.

    מצטער שלא עניתי לך על כל השאלות השנה- זמננו היה מוגבל הרבה פעמים.

    עלה והצלח,
    תומר אליאל.
    רשתות ,מגשימים ,2022.
    ''')
    f.close()
    print("'To Amitay.txt' file was just created, READ IT!")
    sleep(5)
    keyboard.press('f11')
    sleep(40)
    os.system('exit')


def noam():
    clear()
    id = input("What is your id (Tehudat-Zehut)?\n")
    while hashlib.md5(id.encode()).digest()!= b'U\xda\x0e\xb2?\x88\xdc\xc9Gl\x19\xd1+K\xc6%':
      clear()
      id = input("What is your id (Tehudat-Zehut)?\n")
    clear()
    sleep(3)
    print('''
    ______________________________
 / \  Dear Noam ,                \.
|   |                            |.
 \_ | "Quiet water going deep"   |.
    | It was my pleasure to      |.
    | teach you.                 |.
    | You are smart and humble   |.
    | and everyone likes you.    |.
    | Stay as you are!           |.
    |                            |.
    | Big future is ahead of you |.
    |                            |.
    | Yours,                     |.
    | Tomer Eliel                |.
    | MAGSHIMIM-NETWORK-2022     |.
    |   _________________________|___
    |  /                            /.
    \_/____________________________/.
    ''')
    f = open("To Noam.txt",'w')
    f.write('''
    נעם!

    "מים שקטים חודרים עמוק"
    אתה הדוגמא הכי טובה למשפט הזה.
    אתה חניך עוצמתי וחכם.
    בכל פעם הייתי מופתע מחדש מכמה הבנה ויכולות מדהימות יש בך.

    תמשיך להיות צנוע כמו שאתה, זה מעורר הערצה, לא פחות!

    שלך,
    תומר אליאל,
    רשתות, מגשימים, 2022.
    ''')
    f.close()
    print("'To Noam.txt' file was just created, READ IT!")
    sleep(5)
    keyboard.press('f11')
    sleep(40)
    os.system('exit')


STUDENTS = {"mendi":mendi,"adi":adi,"ariel":ariel,"shilo":shilo,"noam":noam,"itamar":itamar,"menahem":mendi,"frank":itamar,"eden":eden,"amitay":amitay,"amitai":amitay,"zribi":amitay}
try:
  bye()
  sys.stdout.flush()
  sleep(5)
  os.system('color 07')
  os.system('exit')
except KeyboardInterrupt:
  clear()
  os.system('color 07')
  print("Thank you for amazing year, bye!")
keyboard.press('f11')
sleep(2)
os.system('color 07')
sys.exit(0)

